# Задача 2: Найдите сумму цифр трехзначного числа.
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

# n = int(input('Введите число:'))
# a = n // 100
# b = n // 10 % 10
# c = n % 10
# print(a + b + c)

# ---------------------------------------------------------------------



# Задача 4: Петя, Катя и Сережа делают из бумаги журавликов.
# Вместе они сделали S журавликов.
# Сколько журавликов сделал каждый ребенок, если известно,
# что Петя и Сережа сделали одинаковое количество журавликов,
# а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?
# 6 -> 1 4 1
# 24 -> 4 16 4
# 60 -> 10 40 10

# n = int(input('Введите число:'))
# p = n * 0.16
# s = n * 0.16
# k = n * 0.66
# print(round(s),round(k),round(p))



# ---------------------------------------------------------------------

# Задача 6: Вы пользуетесь общественным транспортом?
# Вероятно, вы расплачивались за проезд и получали билет с номером.
# Счастливым билетом называют такой билет с шестизначным номером,
# где сумма первых трех цифр равна сумме последних трех.
# Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6.
# Вам требуется написать программу, которая проверяет счастливость билета.
# 385916 -> yes
# 123456 -> no

# n = input('Введите число: ')
# if int(n[0])+int(n[1])+int(n[2])==int(n[3])+int(n[4])+int(n[5]):
#   print('Счастливый')
# else:
#   print('Обычный')


# ---------------------------------------------------------------------

# Задача 8: Требуется определить, можно ли от шоколадки размером
# n × m долек отломить k долек, если разрешается сделать один разлом
# по прямой между дольками (то есть разломить шоколадку на два прямоугольника).
# 3 2 4 -> yes
# 3 2 1 -> no
# ( вообще не понял как записывать, написал шуточное решение )

n = int(input('Введите ширину шоколадки: '))
m = int(input('Введите длину шоколадки: '))
k = int(input('Сколько долек хотите отломить? '))
if k == 4 or 3 or 2:
    print('YES')
else:
    print('NO')








